HUNTING_ZONE_ENTER_MESSAGE = (
    "<b>🎯Охота начата!</b>\n\n" "<i>Зона Охоты:</i> <b>{}</b>\n\n" "{}"
)

HUNTING_ZONE_NOT_AVAILABLE = "<b>❌Данная Зона Охоты не доступна!</b>\n\n" "{}"

ALREADY_IN_ZONE_MESSAGE = "<b>❌Ошибка!</b>\n\n" "Вы уже охотитесь в <b>{}</b>"

PREPARING_HUNTING_END_MESSAGE = (
    "<b>🎯Охота окончена!</b>\n\n"
    "⏳ Высчитываем полученный <b>🔮Опыт</b> и <b>🪵Трофеи</b>\n\n"
    "⚠️ Это занимает приблизительно 5-10 секунд"
)

HUNTING_CONTINUE_MESSAGE = "🎯Охота продолжается!"

HUNTING_END_MESSAGE = "🎯Охота окончена!"

HUNTING_STAT_MESSAGE = (
    "ℹ️<b>Статистика Охоты:</b>\n\n"
    "<i>🔮Получено Опыта:</i> <b>{}%</b>\n"
    "<i>⚔️Убито Монстров:</i> <b>{}</b>\n"
    "<i>🪵Трофеи:</i> <b>{}</b>\n\n"
    "{}"
)

EXIT_HUNTING_CONFIRMATION_MESSAGE = (
    "<b>⚠️Подтверждение!</b>\n\n"
    "Вы уверены, что закончить <b>🎯Охоту</b> и "
    "выйти из <b>{}</b>"
)
