MASTER_SHOP_PREVIEW_MESSAGE = (
    "<b>⚒ Мастерская</b>\n\n"
    "Здесь Мастеры могут изготавливать предметы "
    "для других персонажей"
)

MASTER_SHOP_CHOOSE_TYPE_MESSAGE = (
    "<b>⚒ Мастерская</b>\n\n" "Выберите тип предмета"
)

MASTER_SHOP_LIST_MESSAGE = "<b>⚒ Мастерская</b>\n\n" "Выберите рецепт"

RECIPE_SHARE_GET_MESSAGE = (
    "<b>{}</b>\n"
    "<i>Мастер:</i> <b>{}</b>\n"
    "<i>Цена:</i> <b>{}🟡</b>\n"
    "<b>{}</b>\n"
    "<i>Требуемые Материалы:</i> <b>{}</b>"
)

MASTER_SHOP_CRAFT_CONFIRM = (
    "⚠️ Подтверждение!\n\n" "Вы уверены, что хотите создать данный предмет?"
)

NOT_ENOUGH_ITEMS_MESSAGE = "<b>❌ Ошибка</b>\n\n" "Недостаточно 🪵Материалов!"

SHARE_RECIPE_USED_MESSAGE_TO_MASTER = (
    "<b>⚠️Уведомление</b>\n\n"
    "<b>{}</b> использовал ваш {}\n\n"
    "<i>Получено:</i> <b>{}🟡</b>"
)

SUCCESS_CRAFT_MESSAGE = (
    "✅ Успешно!\n\n"
    "Изготовление прошло успешно!\n\n"
    "<i>Получено:</i> <b>{}</b>"
)

FAIL_CRAFT_MESSAGE = "<b>❌ Неудачно</b>\n\n" "Изготовление не получилось!"

RECIPE_SEARCH_MESSAGE = "🔎 Поиск\n\n" "Введите название рецепта в сообщении"

RECIPE_SEARCH_AMOUNT_MESSAGE = (
    "🔎 Поиск\n\n" "Найдено <b>{}</b> рецепт(ов) по запросу: <b>{}</b>"
)

SEARCH_RECIPE_LIST_MESSAGE = "🔎 Поиск\n\n" "Список найденных рецептов:"


CHARACTER_RECIPE_GET_MESSAGE = (
    "<b>{}</b>\n" "<b>{}</b>\n" "<i>Требуемые Материалы:</i> <b>{}</b>"
)

RECIPE_LIST_MESSAGE = (
    "<b>📜Ваши Общие Рецепты</b>\n\n"
    "<i>Количество выставленных рецептов:</i> <b>{}/{}</b>"
)

ENTER_RECIPE_PRICE_MESSAGE = (
    "<b>✅Добавление рецепта в мастерскую</b>\n\n"
    "Введите стоимость изготовление\n"
)

RECIPE_CREATE_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите добавить в общую мастерскую: \n\n"
    "<b>{}</b>\n"
    "<i>Стоимость изготовления:</i> <b>{}🟡</b>"
)

RECIPE_DELETE_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите удалить рецепт из общей мастерской: \n\n"
    "<b>{}</b>\n"
)

SUCCESS_DELETE_RECIPE_MESSAGE = (
    "<b>✅Успешно</b>\n\n" "<b>{}</b> удален из общей мастерской!\n"
)

FAIL_CREATE_RECIPE_MESSAGE = (
    "<b>❌ Ошибка</b>\n\n"
    "Вы превысили максимальное количество "
    "выставленных рецептов в общую мастерскую!"
)

SUCCESS_CREATE_RECIPE_MESSAGE = (
    "<b>✅Успешно</b>\n\n" "<b>{}</b> добавлен в общую мастерскую!\n"
)
