MASTER_SHOP_PREVIEW_MESSAGE = (
    "<b>⚒ Мастерская</b>\n\n"
    "Здесь Мастеры могут изготавливать предметы "
    "для других персонажей"
)

MASTER_SHOP_CHOOSE_TYPE_MESSAGE = (
    "<b>⚒ Мастерская</b>\n\n" "Выберите тип предмета"
)

MASTER_SHOP_LIST_MESSAGE = "<b>⚒ Мастерская</b>\n\n" "Выберите рецепт"

RECIPE_SHARE_GET_MESSAGE = (
    "<b>{}</b>\n"
    "<i>Мастер:</i> <b>{}</b>\n"
    "<i>Цена:</i> <b>{}🟡</b>\n"
    "<b>{}</b>\n"
    "<i>Требуемые Материалы:</i> <b>{}</b>"
)

MASTER_SHOP_CRAFT_CONFIRM = (
    "⚠️ Подтверждение!\n\n" "Вы уверены, что хотите создать данный предмет?"
)
