PREMIUM_PREVIEW_MESSAGE = (
    "<b>🏬 Премиум Магазин</b>\n\n"
    "<i>Здесь ты можешь:</i>\n"
    "1️⃣Пополнить баланс <b>💎Алмазов</b>\n"
    "2️⃣Купить <b>🎟Премиум Подписку</b>\n"
    "3️⃣Купить различные товары для ускорения развития"
)

NO_CHARACTER_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Чтобы пользоваться <b>🏬 Премиум Магазином</b> "
    "требуется создать персонажа"
)

DIAMONDS_MESSAGE = (
    "💎Алмазы\n\n"
    "С помощью 💎Алмазов можно купить "
    "предметы в <b>🏬 Премиум Магазине</b> "
    "и на <b>💱Торговой Площадке</b>"
)

PREMIUM_LIST_MESSAGE = "<b>🏬Список Доступных Товаров</b>"

PREMIUM_LOT_GET_MESSAGE = (
    "<b>{}</b> - <i>{} шт.</i>\n\n"
    "ℹ️{}\n\n"
    "<i>Получаемые предметы:</i>\n{}\n\n"
    "<i>Стоимость:</i>\n{}\n\n"
)

PREMIUM_BUY_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n" "Вы уверены, что хотите купить данный товар?"
)

NOT_ENOUGH_CURRENCY = "❌ Неудачно!\n\n" "Недостаточно <b>💎Алмазов</b>!"

SUCCESS_BUY_MESSAGE = "✅ Успешно!\n\n" "Получено: <b>{}</b>\n"
