NO_CLAN_MESSAGE = (
    "<b>🏰 Клан</b>\n\n"
    "Находи соратников, чтобы давать отпор врагам, "
    "ходить на Боссов и получать редкие предметы"
)

CREATE_PREVIEW_MESSAGE = (
    "Придумай <b>Название</b> для своего <b>🏰 Клана</b>\n"
    "1️⃣ Максимальное количество символов - <b>16</b>\n"
    "2️⃣ Нельзя использовать специальные символы (@!#$ и т.д)"
)

CLAN_TAKEN_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Данное название <b>🏰 Клана</b> уже занято.\n"
    "Попробуй другое"
)

CLAN_NAME_NOT_CORRECT_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Данное название <b>🏰 Клана</b> содержит "
    "некорректные символы или превышает допустимую длину"
)

CLAN_NAME_CONFIRM_MESSAGE = (
    "✅ Отлично!\n\n"
    "Название твоего <b>🏰 Клана</b> будет:\n"
    "<b>{}</b>\n\n"
    "Продолжим?"
)

ERROR_CREATING_CLAN_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Произошла ошибка при создании <b>🏰 Клана</b>. Попробуй еще раз"
)

SUCCESS_CREATING_CLAN_MESSAGE = (
    "✅ Отлично!\n\n"
    "Ты создал <b>🏰 Клан</b>\n"
    "<i>Здесь ты можешь:</i>\n"
    "1️⃣ Настроить доступ в клан по заявкам или без\n"
    "2️⃣ Добавить Описание, Эмблему Клана\n"
    "3️⃣ Объявлять войну другим кланам\n"
    "4️⃣ Выгонять Персонажей из Клана"
)

GET_CLAN_MESSAGE = (
    "<b>{}</b> Ур. {} ⚔️{}\n"
    "<i>Лидер:</i> <b>{}</b>\n\n"
    "ℹ️{}\n\n"
    "<i>👥Количество Членов Клана:</i> <b>{}/{}</b>\n"
    "<i>🚩Репутация:</i> <b>{}</b>\n\n"
)

CLAN_LIST_MESSAGE = "<b>🏰 Список Кланов</b>\n\n"

CLAN_SEARCH_MESSAGE = "🔎 Поиск\n\n" "Введите название Клана в сообщении"

CLAN_SEARCH_AMOUNT_MESSAGE = (
    "🔎 Поиск\n\n" "Найдено <b>{}</b> клан(ов) по запросу: <b>{}</b>"
)

SEARCH_CLAN_LIST_MESSAGE = "🔎 Поиск\n\n" "Список найденных Кланов:"

CREATE_REQUEST_MESSAGE_TO_LEADER = (
    "<b>🖋Новая Заявка</b>\n\n" "В ваш Клан оформлена новая заявка от <b>{}</b>"
)

CREATE_REQUEST_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите подать заявку в этот Клан?\n"
    "❗️ Все Ваши другие Заявки будут удалены!"
)

ERROR_IN_CREATING_REQUEST_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Произошла ошибка при создании <b>🖋 Заявки</b>. Попробуй еще раз"
)

SUCCESS_CREATING_REQUEST_MESSAGE = (
    "✅ Успешно!\n\n" "Заявка подана! После ее рассмотрения придет Уведомление"
)

REQUEST_LIST_MESSAGE = "<b>🖋Заявки</b>\n\n"

ERROR_IN_ACCEPTING_REQUEST_MESSAGE = (
    "❌ Ошибка!\n\n" "Произошла ошибка при принятии персонажа в Клан!"
)

SUCCESS_ACCEPTING_REQUEST_MESSAGE = (
    "<b>✅Успешно!</b>\n\n" "Вы приняли персонажа {} в Клан!"
)

SUCCESS_DECLINING_REQUEST_MESSAGE = (
    "<b>✅Успешно!</b>\n\n" "Вы отклонили заявку персонажа {} в Клан!"
)

SUCCESS_ACCEPTING_REQUEST_MESSAGE_TO_USER = (
    "<b>✅Ваша Заявка была рассмотрена!</b>\n\n" "Вы приняты в Клан {}!"
)

SUCCESS_DECLINE_REQUEST_MESSAGE_TO_USER = (
    "<b>✅Ваша Заявка была рассмотрена!</b>\n\n" "Вас не приняли в Клан {}!"
)

CLAN_ENTER_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите войти в этот Клан?\n"
    "❗️ Все Ваши другие Заявки будут удалены!"
)

CLAN_EXIT_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n" "Вы уверены, что хотите выйти из этого Клана?"
)

CLAN_EXIT_MESSAGE = "<b>✅Успешно!</b>\n\n" "Вы вышли из Клана!"

ERROR_IN_ENTER_CLAN_MESSAGE = (
    "❌ Ошибка!\n\n" "Произошла ошибка при входе в Клан!"
)

SUCCESS_ENTER_CLAN_MESSAGE = "<b>✅Успешно!</b>\n\n" "Вы приняты в Клан {}!"

NO_PLACE_IN_CLAN_MESSAGE = "❌ Неудачно!\n\n" "В клане нет места!"

MEMBERS_LIST_MESSAGE = "<b>👥Члены Клана</b>"

MEMBER_KICK_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите выгнать этого Персонажа из Клана?"
)

ERROR_IN_KICK_MEMBER_MESSAGE = (
    "❌ Ошибка!\n\n" "Произошла ошибка при исключении Персонажа из Клана!"
)

SUCCESS_KICKING_MEMBER_MESSAGE_TO_USER = (
    "<b>🏰 Клановое оповещение</b>\n\n" "Вас выгнали из Клана <b>{}</b>"
)

SUCCESS_KICKING_MEMBER_MESSAGE = (
    "<b>✅Успешно!</b>\n\n" "Вы исключили {} из Клана!"
)
