LOCATION_LIST_MESSAGE = (
    "<b>📍Локации</b>\n\n"
    "⚠️У каждой локации существует рекомендуемая "
    "<b>⚔️Атака</b> и <b>🛡Защита</b>\n\n"
    "В зависимости от разницы твоих характеристик "
    "с рекомендуемыми ты получаешь "
    "<b>🍀Бонусы</b> или <b>❌Штрафы</b> "
    "во время <b>🎯Охоты</b>"
)
LOCATION_GET_MESSAGE = (
    "<b>{}</b> ⚔️{} 🛡{}\n\n"
    "{}\n"
    "{}\n"
    "⏳ Максимальное время охоты: <b>{}</b> минут\n\n"
    "Возможные трофеи (Выдается ежеминутно):\n{}"
)

LOCATION_ENTER_MESSAGE = (
    "<b>🎯Охота начата!</b>\n\n"
    "📍Локация: <b>{}</b>\n"
    "⏳Конец охоты через: <b>{}</b>\n\n"
    "⚠️По окончанию охоты я оповещу тебя"
)

HUNTING_END_MESSAGE = (
    "<b>🎯Охота окончена!</b>\n\n"
    "Получено:\n"
    "<b>🔮Опыт:</b> {}\n"
    "<b>🪵Трофеи:</b> {}"
)

EXIT_LOCATION_CONFIRMATION_MESSAGE = (
    "<b>⚠️Подтверждение!</b>\n\n"
    "Вы уверены, что закончить <b>🎯Охоту</b> и "
    "выйти из <b>📍Локации</b>"
)
