LOCATION_LIST_MESSAGE = "Выберите локацию"
LOCATION_GET_MESSAGE = (
    "<b>{}</b> ⚔️{} 🛡{}\n\n"
    "{}\n"
    "{}\n"
    "⏳ Максимальное время охоты: <b>{}</b> минут\n\n"
    "Возможные трофеи (Выдается ежеминутно):\n{}"
)

LOCATION_ENTER_MESSAGE = (
    "Вы начали охоту в локации: <b>{}</b>\n"
    "Окончание охоты через <b>{}</b>\n\n"
    "Когда охота закончится - я пришлю тебе сообщение"
)

HUNTING_END_MESSAGE = (
    "<b>Охота окончена</b>\n"
    "За время охоты получено: {} опыта\n"
    "Трофеев: \n{}"
)

EXIT_LOCATION_CONFIRMATION_MESSAGE = "Вы уверены, что хотите выйти из Локации?"

EXIT_LOCATION_MESSAGE = (
    "Вы вернулись в город!\n\n" "Получено: {} опыта\n" "Трофеев: \n{}"
)
