ITEM_PREVIEW_MESSAGE = "Выберите тип предметов\n\n" "🟡Золото: {}"

ITEM_LIST_MESSAGE = "Ваш инвентарь"

ITEM_GET_MESSAGE = "<b>{}</b> - {} шт.\n\n" "{}\n" "<b>{}</b>\n" "<b>{}</b>"

SUCCESS_USE_POTION_MESSAGE = "Вы успешно использовали: <b>{}</b>"

SUCCESS_OPEN_BAG_MESSAGE = (
    "Вы открыли <b>{}</b> в количестве {} шт.\n"
    "Получено:\n<b>{}</b>\n"
    "Осталось сундуков: <b>{} шт.</b>"
)

NOT_SUCCESS_EQUIP_MESSAGE = "Данный предмет надеть невозможно!"

SCROLL_LIST_MESSAGE = "Выберите предмет для улучшения"

ENHANCE_GET_MESSAGE = (
    "<b>{}\n{}</b>\n{}\n"
    "🎲Шанс улучшения: <b>{}</b>%\n"
    "✅При успехе <b>все характеристики</b> предмета увеличится на <b>{}</b>\n"
    "⚠️При неудаче Предмет останется "
    "с тем же уровнем улучшения"
)
