LOCATION_LIST_MESSAGE = "Выберите локацию"
LOCATION_GET_MESSAGE = (
    "<b>{}</b>\n"
    "Рекомендуемая сила персонажа: <b>{}</b>\n"
    "Ваша сила отличается с силой локации на {}. "
    "За это вы получаете {}% к получению опыта и трофеев.\n\n"
    "Возможные трофеи:\n{}"
)

LOCATION_ENTER_MESSAGE = (
    "Вы начали охоту в локации: <b>{}</b>\n"
    "Время охоты: <b>{}</b>\n\n"
    "Когда охота закончится - я пришлю тебе сообщение"
)

HUNTING_END_MESSAGE = (
    "<b>Охота окончена</b>\n"
    "Забирай трофеи и вперед за следующими приключениями"
)
