CREATE_REQUEST_MESSAGE_TO_LEADER = (
    "<b>🖋Новая Заявка</b>\n\n" "В ваш Клан оформлена новая заявка от <b>{}</b>"
)

CREATE_REQUEST_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите подать заявку в этот Клан?\n"
    "❗️ Все Ваши другие Заявки будут удалены!"
)

ERROR_IN_CREATING_REQUEST_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Произошла ошибка при создании <b>🖋 Заявки</b>. Попробуй еще раз"
)

SUCCESS_CREATING_REQUEST_MESSAGE = (
    "✅ Успешно!\n\n" "Заявка подана! После ее рассмотрения придет Уведомление"
)

REQUEST_LIST_MESSAGE = "<b>🖋Заявки</b>\n\n"

ERROR_IN_ACCEPTING_REQUEST_MESSAGE = (
    "❌ Ошибка!\n\n" "Произошла ошибка при принятии персонажа в Клан!"
)

NO_PLACE_IN_CLAN_MESSAGE = "❌ Неудачно!\n\n" "В клане нет места!"

SUCCESS_ACCEPTING_REQUEST_MESSAGE = (
    "<b>✅Успешно!</b>\n\n" "Вы приняли персонажа {} в Клан!"
)

SUCCESS_DECLINING_REQUEST_MESSAGE = (
    "<b>✅Успешно!</b>\n\n" "Вы отклонили заявку персонажа {} в Клан!"
)

SUCCESS_ACCEPTING_REQUEST_MESSAGE_TO_USER = (
    "<b>✅Ваша Заявка была рассмотрена!</b>\n\n" "Вы приняты в Клан {}!"
)

SUCCESS_DECLINE_REQUEST_MESSAGE_TO_USER = (
    "<b>✅Ваша Заявка была рассмотрена!</b>\n\n" "Вас не приняли в Клан {}!"
)
