NO_CHARACTER_MESSAGE = (
    "❗️Чтобы пользоваться <b>💱Торговой Площадкой</b> "
    "требуется создать персонажа"
)

MARKETPLACE_PREVIEW_MESSAGE = (
    "<b>💱Торговая Площадка</b>\n\n"
    "Здесь Вы можете купить или продать предметы "
    "другим пользователям за <b>🟡Золото</b> или <b>💎Алмазы</b>"
)

PREVIEW_MESSAGE = "Выберите тип предмета:"

CHOOSE_BUY_CURRENCY_MESSAGE = "Выберите валюту покупки!"

SELL_LIST_MESSAGE = "Выберите предмет:"

SELL_GET_MESSAGE = "<b>{}</b> - {} шт.\n\n" "{}\n" "<b>{}</b>\n" "Лоты:\n{}"

ADD_PREVIEW_MESSAGE = "Выберите валюту продажи предмета!"

ADD_PRICE_MESSAGE = "Укажите цену вашего товара!"

NOT_CORRECT_PRICE_MESSAGE = "Неверная цена товара! Введите цену снова"

CORRECT_PRICE_MESSAGE = (
    "Отлично цена товара установлена!\n"
    "Теперь укажите количество товара для продажи"
)

CONFIRM_LOT_MESSAGE = (
    "Ваш лот:\n\n"
    "<b>{}</b> - {} шт.\n"
    "Цена: <b>{} {}</b>\n"
    "Вы получите: <b>{} {}</b> (Комиссия {}%)\n\n"
    "Выставить на торговую площадку?"
)

SUCCESS_LOT_MESSAGE = "Вы успешно добавили предмет на продажу!"

NOT_SUCCESS_LOT_MESSAGE = (
    "Произошла ошибка при добавлении лота! Попробуйте снова"
)

BUY_GET_MESSAGE = (
    "<b>{}</b> - {} шт.\n\n" "{}\n" "<b>{}</b>\n" "Цена: <b>{}</b>"
)

BUY_CONFIRM_MESSAGE = (
    "Вы уверены, что хотите купить <b>{}</b> - <b>{} шт.</b> за <b>{}</b>?"
)

SUCCESS_SELL_MESSAGE = (
    "Вы продали <b>{}</b> - <b>{}</b> шт. и получили <b>{}</b>"
)


ITEM_LIST_MESSAGE = "Список ваших выставленных предметов на продажу"

REMOVE_CONFIRM_MESSAGE = "Вы уверены, что хотите удалить лот с продажи?"

NO_MARKETPLACE_ITEM_MESSAGE = "❗️ Данный лот уже был удален или выкуплен!"

ITEM_SEARCH_MESSAGE = "Введите название предмета в сообщении"

ITEM_SEARCH_AMOUNT_MESSAGE = "Найдено <b>{}</b> лот(ов) по запросу: <b>{}</b>"

SEARCH_ITEM_LIST_MESSAGE = "Список найденных предметов:"
