NO_CHARACTER_MESSAGE = (
    "❗️Чтобы пользоваться <b>💱Торговой Площадкой</b> "
    "требуется создать персонажа"
)

MARKETPLACE_PREVIEW_MESSAGE = (
    "<b>💱Торговая Площадка</b>\n\n"
    "Здесь Вы можете купить или продать предметы "
    "другим пользователям за <b>🟡Золото</b> или <b>💎Алмазы</b>"
)

SELL_PREVIEW_MESSAGE = "Выберите тип предмета:"

SELL_LIST_MESSAGE = "Выберите предмет:"

SELL_GET_MESSAGE = "<b>{}</b> - {} шт.\n\n" "{}\n" "<b>{}</b>\n" "Лоты:\n{}"

ADD_PREVIEW_MESSAGE = "Выберите валюту продажи предмета!"

ADD_PRICE_MESSAGE = "Укажите цену вашего товара!"

NOT_CORRECT_PRICE_MESSAGE = "Неверная цена товара! Введите цену снова"

CORRECT_PRICE_MESSAGE = (
    "Отлично цена товара установлена!\n"
    "Теперь укажите количество товара для продажи"
)

CONFIRM_LOT_MESSAGE = (
    "Ваш лот:\n\n"
    "<b>{}</b> - {} шт.\n"
    "Цена: <b>{} {}</b>\n"
    "Выставить на торговую площадку?"
)

SUCCESS_LOT_MESSAGE = "Вы успешно добавили предмет на продажу!"

NOT_SUCCESS_LOT_MESSAGE = (
    "Произошла ошибка при добавлении лота! Попробуйте снова"
)
