LOOK_WAREHOUSE_MESSAGE = "<b>👁‍🗨Просмотр Хранилища</b>"

SEND_LIST_MESSAGE = "<b>Выберите Персонажа для отправки Предмета</b>"

ENTER_AMOUNT_MESSAGE = (
    "<b>📩Передача Предмета</b>\n\n"
    "Введите количество <b>{}</b>\n"
    "Для передачи персонажу <b>{}</b>\n\n"
    "<i>❗️ В наличии:</i> <b>{} шт.</b>"
)

SEND_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите отправить: \n\n"
    "<b>{} - {} шт.</b>\n\n"
    "Персонажу: <b>{}</b>"
)

SUCCESS_SEND_MESSAGE = (
    "<b>✅ Успешно</b>\n\n"
    "Вы отправили:\n\n"
    "<b>{} - {} шт.</b>\n\n"
    "Персонажу: <b>{}</b>"
)

SUCCESS_SEND_MESSAGE_TO_USER = (
    "<b>📩Передача Предмета</b>\n\n"
    "Вы получили от Клана:\n\n"
    "<b>{} - {} шт.</b>\n\n"
)
