SKILL_LIST_MESSAGE = "<b>✨Способности</b>"

SKILL_GET_MESSAGE = (
    "<b>{}</b>\n"
    "<i>Тип:</i> <b>{}</b>\n\n"
    "ℹ️{}\n\n"
    "{}"
    "<i>Эффекты:</i>\n{}"
)

TOGGLE_SKILL_INFO_MESSAGE = (
    "<i>Расход:</i>\n"
    "<i>🎯Охота (в минуту), PvP (за удар):</i> <b>{}</b> 🔷Маны\n"
)
ACTIVE_SKILL_INFO_MESSAGE = (
    "<i>Стоимость:</i> <b>{}</b> 🔷Маны\n"
    "{}"
    "<i>⌛️Перезарядка:</i> <b>{}</b>\n\n"
)

NOT_ENOUGH_MANA_MESSAGE = "❌ Неудачно!\n\n" "Недостаточно 🔷Маны"

NOT_READY_SKILL_MESSAGE = (
    "❌ Неудачно!\n\n" "Способность еще не готова к использованию"
)

SUCCESS_USE_SKILL_MESSAGE = (
    "✅ Успешно!\n\n" "Вы использовали умение: <b>{}</b>\n"
)
