DUNGEON_LIST_MESSAGE = (
    "<b>☠️Подземелья</b>\n\n"
    "В подземелье можно получать больше опыта или "
    "добывать редкие ресурсы.\n\n"
    "⚠️ За вход в подземелье взымается определенная плата\n\n"
    "У подземелья есть максимальное время охоты в день"
)

DUNGEON_GET_MESSAGE = (
    "<b>{}</b>\n"
    "<i>Доступно через:</i> <b>{}</b>\n"
    "<i>Максимальное время охоты:</i> <b>{} часа(ов)</b>\n"
    "<i>🔮Опыт:</i> <b>{}%</b> в минуту\n\n"
    "<i>Возможные Трофеи:</i>\n{}\n"
    "<i>Стоимость входа:</i>\n{}\n"
)

ENTER_DUNGEON_CONFIRM_MESSAGE = (
    "<b>⚠️Подтверждение!</b>\n\n" "Вы уверены, что войти в данное Поздемелье?"
)

NOT_ENOUGH_REQUIRED_ITEMS_MESSAGE = (
    "<b>❌Ошибка!</b>\n\n" "Недостаточно необходимых предметов!"
)

NOT_READY_DUNGEON_MESSAGE = (
    "<b>❌Ошибка!</b>\n\n" "Вы не можете войти в <b>{}</b>!"
)

DUNGEON_ENTER_ADD_INFO: str = "⚠️ По окончанию охоты я оповещу тебя!"

DUNGEON_HUNTING_END_MESSAGE = (
    "ℹ️<b>Охота Окончена:</b>\n\n"
    "<i>🔮Получено Опыта:</i> <b>{}%</b>\n"
    "<i>⚔️Убито Монстров:</i> <b>{}</b>\n"
    "<i>🪵Трофеи:</i> <b>{}</b>\n\n"
)
