SETTINGS_LIST_MESSAGE = "<b>⚙️Настройки Клана</b>"

SETTINGS_EMOJI_MESSAGE = (
    "<b>🏳️Изменить Иконку</b>\n\n"
    "<i>Ваша иконка:</i> {}\n\n"
    "Выберете новую иконку"
)

EMOJI_SET_MESSAGE = (
    "✅ Успешно!\n\n"
    "Иконка {} установлена"
)

SETTINGS_DESCRIPTION_MESSAGE = (
    "<b>ℹ️Изменить Описание</b>\n\n"
    "<i>Текущее описание:</i>\n\n"
    "<b>{}</b>\n\n"
    "Введите новое описание в сообщении\n"
    "<b>(Не более 128 символов)</b>"
)

NO_CORRECT_DESCRIPTION_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Описание не соответствует требованиям. Попробуйте еще раз!"
)

ERROR_IN_DESCRIPTION_CHANGE_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Произошла ошибка при изменении описания. Попробуйте еще раз!"
)

SUCCESS_DESCRIPTION_CHANGE_MESSAGE = (
    "✅ Успешно!\n\n"
    "Описание изменено"
)

SETTINGS_ACCESS_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите изменить доступ в Клан на:\n"
    "<b>{}</b>\n\n"
    "❗️ {}"
)

BY_REQUEST_CLAN_DESCRIPTION = (
    "Персонажи смогут вступить в Клан только после "
    "одобрения <b>Заявки</b>"
)

OPEN_CLAN_DESCRIPTION = (
    "Любой персонаж сможет вступить в Клан"
)

SUCCESS_ACCESS_CHANGE_MESSAGE = (
    "✅ Успешно!\n\n"
    "Доступ в Клан изменен"
)


SETTINGS_REMOVE_CONFIRM_MESSAGE = (
    "<b>⚠️ Подтверждение</b>\n\n"
    "Вы уверены, что хотите распустить свой Клан?\n\n"
    "❗️ Для роспуска требуется выгнать всех персонажей из Клана!"
)

NOT_LEADER_REMOVING_CLAN_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Только лидер Клана может распустить клан"
)

NOT_EMPTY_REMOVING_CLAN_MESSAGE = (
    "❌ Ошибка!\n\n"
    "Нельзя распустить Клан в котором есть Персонажи"
)

SUCCESS_REMOVE_CLAN_MESSAGE = (
    "✅ Успешно!\n\n"
    "Клан распущен"
)
