CREATE_CHARACTER_MESSAGE = "Введите имя персонажа:"

NICKNAME_TAKEN_MESSAGE = "Данное имя уже занято. Попробуйте другое"

NICKNAME_NOT_CORRECT_MESSAGE = (
    "Максимальная длина имени персонажа 16 букв.\n"
    "Нельзя использовать специальные символы"
)

NICKNAME_CONFIRM_MESSAGE = (
    "Имя вашего персонажа будет: {}\n" "Хотите продолжить?"
)

CHOOSE_CLASS_MESSAGE = (
    "Отлично! Теперь выберите класс своего персонажа!\n"
    "Нажмите на класс, чтобы узнать подробнее про него"
)

CLASS_GET_MESSAGE = (
    "<b>{}</b> \n\n" "{}\n" "Атака: {}\n" "Защита {}\n" "Носит: {}"
)

CHARACTER_INFO_MESSAGE = (
    "<b>{}</b> {} Ур. {} 🔮{}%"
    "\n\n"
    "⚔️Атака: <b>{}</b> 🛡Защита: <b>{}</b>\n\n"
    "📍Локация: {}\n\n"
)

CHARACTER_KILL_MESSAGE = (
    "Ваш персонаж был убит!\n\n"
    "За время охоты получено: {} опыта\n"
    'Трофеев: \n{}"'
)

SKILL_LIST_MESSAGE = "Умения вашего персонажа:"

SKILL_GET_MESSAGE = "<b>{}</b>\n\n" "{}\n" "Эффекты:\n{}"

CHARACTER_ABOUT_MESSAGE = (
    "<b>{}</b> {} Ур. {} 🔮{}%\n"
    "⚔️Атака: <b>{}</b> 🛡Защита: <b>{}</b>\n\n"
    "Получение опыта: <b>+{}%</b>\n"
    "Шанс трофеев: <b>+{}%</b>\n\n"
    "Надето:\n{}\n\n"
    "Эффекты от умений:\n{}\n\n"
    "Эффекты от эликсиров:\n{}"
)
