CREATE_CHARACTER_MESSAGE = "Введите имя персонажа:"

NICKNAME_TAKEN_MESSAGE = "Данное имя уже занято. Попробуйте другое"

NICKNAME_NOT_CORRECT_MESSAGE = (
    "Максимальная длина имени персонажа 16 букв.\n"
    "Нельзя использовать специальные символы"
)

NICKNAME_CONFIRM_MESSAGE = (
    "Имя вашего персонажа будет: {}\n" "Хотите продолжить?"
)

CHOOSE_CLASS_MESSAGE = (
    "Отлично! Теперь выберите класс своего персонажа!\n"
    "Нажмите на класс, чтобы узнать подробнее про него"
)

CLASS_GET_MESSAGE = (
    "<b>{}</b>\n\n"
    "{}\n"
    "Атака: {}\n"
    "Защита {}\n"
    "Тип брони: {}\n"
    "Тип оружия: {}\n"
)

CHARACTER_INFO_MESSAGE = (
    "<b>{}</b>\n\n"
    "Уровень: <b>{}</b>\n"
    "Опыт: <b>{}%</b>\n"
    "Атака: <b>{}</b>\n"
    "Защита: <b>{}</b>\n\n"
    "Локация: {}"
)
