PVP_CHARACTER_GET_MESSAGE = (
    "<b>{}</b>\n"
    "<i>Клан:</i> <b>{}</b>\n\n"
    "<i>Надето:</i> \n{}\n"
    "<i>Эффекты Эликсиров:</i>\n{}"
)

CHARACTER_KILL_MESSAGE = (
    "🪦 Вы погибли!\n\n" "⚔️Убийца: {}\n" "Потеряно: <b>{} 🔮Опыта</b>:"
)

NO_WAR_KILL_CONFIRM_MESSAGE = (
    "Если {} не будет сопротивляться\n"
    "Вы получите <i>Эффект:</i>\n"
    "<b>♦️Усталость</b> (⚔️Атака -10%, 🛡Защита -10%) на <i>1 час</i>"
)

WAR_KILL_CONFIRM_MESSAGE = "При убийстве Ваш Клан получит <b>🚩1 Репутацию</b>"

CHARACTER_KILL_CONFIRM_MESSAGE = (
    "<b>⚠️Подтверждение!</b>\n\n"
    "Вы уверены, что хотите атаковать {}?\n\n"
    "⚠️ {}"
)

DAMAGE_INFO = "\n<i>Нанесено:</i> <b>{} Урона</b>\n"

CRITICAL_DAMAGE_INFO = (
    "♦️Критический Удар\n" "<i>Нанесено:</i> <b>{} Урона</b>\n"
)

NOT_SUCCESS_ATTACK_INFO = "\n<b>{}</b> уклонился от вашей атаки\n"

ATTACK_CHARACTER_MESSAGE = (
    "<b>⚔️ Вы атаковали {}!</b>\n" "{}" "⚠️ Следующая атака возможна через {}"
)

ATTACK_CHARACTER_MESSAGE_TO_TARGET = (
    "<b>⚔️ Вас атаковал {}!</b>\n\n"
    "<i>❤️Вы потеряли:</i> <b>{} Здоровья</b>\n\n"
    "<i>❤️Здоровье:</i> <b>{}</b>"
)

NO_CHARACTER_CURRENT_LOCATION = (
    "<b>❌ Ошибка!</b>\n\n" "<b>{}</b> находится в <b>Городе</b>"
)

KILL_CHARACTER_MESSAGE_TO_ATTACKER = (
    "⚔️ Успешная атака\n\n" "{} погиб\n\n" "<i>Получено:</i>"
)

KILL_CHARACTER_MESSAGE_TO_TARGET = (
    "🪦 Вы погибли!\n\n" "⚔️Убийца: {}\n" "Потеряно: <b>{} 🔮Опыта</b>:"
)

WAR_KILL_MESSAGE_TO_ATTACKER = "\n<b>🚩1 Репутация</b>"

NO_WAR_KILL_MESSAGE_TO_ATTACKER = (
    "\n<b>♦️Усталость</b> (⚔️Атака -10%, 🛡Защита -10%)"
)
